david0ha/wp_news_esp32/sdkconfig.defaults
# Shared project configuration. Per-developer settings (and anything secret)
# belong in the generated `sdkconfig`, which is gitignored.
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000

# Every glyph on this board comes from the seven generated newspaper faces in
# components/news_core/fonts/ (see ui_fonts.h). Montserrat 14 is kept for one
# reason only: LVGL's LV_FONT_DEFAULT choice offers built-in faces and nothing
# else, and a display created before that symbol resolves will not link. Nothing
# is actually drawn with it — every helper in ui_internal.h takes its font
# explicitly — so the other four sizes this board used to carry are gone.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# LVGL allocates its widgets from the PSRAM, through the nine functions in
# components/app_bsp/lvgl_mem_psram.c, rather than from the 64 KB static pool in
# internal .bss that LV_USE_BUILTIN_MALLOC defaults to. The front page is 390
# objects and 197,096 bytes the moment ui_news_create() returns — measured, in
# the simulator, against this exact UI code — peaking at 202,672 across both
# pages and the overlays. That is three times the default pool, and it does not
# fit in ANY internal pool: the boot log leaves about 186 KiB of internal DRAM
# free once the 64 KB pool has been reserved, and Wi-Fi and mbedTLS have to come
# out of what remains.
#
# Getting this wrong does not report itself. lv_obj_class_create_obj() stores
# into the result of an unchecked lv_realloc(), so a full LVGL heap arrives as a
# StoreProhibited on a small address, in whichever widget happened to be next.
CONFIG_LV_USE_CUSTOM_MALLOC=y
# CONFIG_LV_USE_BUILTIN_MALLOC is not set

# The news snapshot normally comes from a machine on the same LAN over plain
# HTTP, so no certificate is involved at all. An https:// URL still works and
# validates against IDF's default bundle; the fortune board this forked from
# carried a custom bundle for a specific weather API, which has no successor
# here and would only be a stale root to maintain.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y

# Task Watchdog. The 10s this used to carry was reasoned about a 648x480 panel;
# this one is 1200x1600 and the work is an order of magnitude bigger, so the
# number is re-derived here from what the board actually does. Measured, on the
# device, from the boot log:
#
#   ui_news_create()   builds ~390 widgets in PSRAM     15.4 s
#   LVGL layout pass   inside lv_refr_now()             10.4 s on a page swap
#   wp_quantize565()   1.92 M px into the PSRAM fb       3.9 s per sheet
#
# None of those is a hung task — a refresh of the glass alone is 27 s — so the
# window is widened rather than the check masked (PANIC stays off either way).
# 60s is four times the worst measured stall and still catches a real wedge
# inside one refresh cycle.
#
# The trap, if this ever looks too generous: the TWDT watches the IDLE tasks,
# and IDLE runs at priority 0, so it is starved by ANY runnable task on its
# core. main is priority 1 and pinned to CPU0. That is why the vTaskDelay(1) in
# Lvgl_FlushCallback does not help — the millisecond it gives up goes to main,
# never to IDLE0 — and why no amount of yielding inside the render can feed
# this. A task cannot reset another task's TWDT entry, and the idle entry is
# the one that fails.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

# -O2 rather than the IDF default of -Og, and 240 MHz rather than 160.
#
# This board spends its time in two loops that are pure arithmetic over large
# arrays — wp_quantize565() across 1.92 million pixels, and LVGL's layout pass
# across ~390 objects that live in PSRAM — and both were being compiled for
# debuggability. The flush measured 2033 ns/px, about 325 cycles for six
# palette distances and a Bayer offset, which is what -Og over PSRAM costs.
#
# The `flush N ms for N px (N ns/px)` line in main.cpp is the instrument for
# this; docs/bring-up.md asks for the number, and it is the one to compare
# before and after rather than trusting the reasoning here. Assertions are
# untouched (-O2 does not remove them), and the app partition is 81% free, so
# the size the optimizer trades for speed is not contended.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# app_main renders the full LVGL screen (provisioning drives the setup overlay
# with Lvgl_RenderNow + epd_refresh_full on the main task) — the IDF default of
# 3584 bytes overflows there, reproducibly, right at the first Wi-Fi connect.
# 8 KB matches UiTask, which exists to run exactly the same render path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The Wi-Fi event task runs provisioning's scan-done handler; the IDF default
# of 2304 bytes left it one log call away from overflow even after the handler
# stopped keeping buffers on its stack. Headroom, cheap at 8 MB PSRAM.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Phone browsers send >512 bytes of request headers to the captive portal;
# esp_http_server's default rejects the setup form with a 431
# ("Header fields are too long") before our handler ever runs.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# Seeed EE04: GPIO43/44 (default UART0 TX/RX) are the e-Paper power-enable and
# CS lines, so the console must live on USB Serial/JTAG — a UART0 console would
# clock log bytes straight into the panel control pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
